In [1]:
import pandas as pd
import numpy as np
pd.options.display.max_columns=None
pd.options.display.max_colwidth=300
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df_grad=pd.read_csv('/home/bea/Escritorio/KSchool_TFM/Principales/Encuesta_insercion_laboral_titulados_universitarios_2019/EILU_GRADUADOS/CSV/EILU_GRAD_2019.csv',
                    sep='\t')

/home/bea/.local/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (119) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df_grad.shape

(31651, 299)

In [4]:
for col in df_grad.columns:
    print(col,df_grad[col].dtype)

IDENT int64
SEXO int64
EDAD int64
NACIO int64
NACIO1 object
NACIO2 object
PAIS_NACI int64
TITU int64
RAMA int64
AMBITO int64
T_UNIV int64
DISCA int64
PROXY int64
LUG_RES_PAIS int64
PAIS_NAC_PADRE int64
ESTUDIOS_PADRE int64
PAIS_NAC_MADRE int64
ESTUDIOS_MADRE int64
EST_B1 int64
EST_B2_1 object
EST_B2_2 object
EST_B2_3 object
EST_B2_4 object
EST_B2_5 object
EST_M1 int64
EST_M2 object
EST_M3 object
EST_M4 object
EST_MES int64
EST_B8 int64
SAT1 int64
SAT2 object
EST_B11_1 int64
EST_B11_2 int64
EST_B11_3 int64
EST_B11_4 int64
EST_B11_5 int64
EST_B11_6 int64
EST_B11_7 int64
EST_B12 object
EST_B13_AMB1 object
EST_B14_1 object
EST_B15_1 object
EST_B13_AMB2 object
EST_B14_2 object
EST_B15_2 object
EST_B13_AMB3 object
EST_B14_3 object
EST_B15_3 object
EST_B16 object
EST_B17_M1 object
EST_B18_1 object
EST_B19_1 object
EST_B17_M2 object
EST_B18_2 object
EST_B19_2 object
EST_B17_M3 object
EST_B18_3 object
EST_B19_3 object
EST_B21 object
EST_B22 object
EST_B23 object
EST_B24 object
EST_B25_FA1 object
EST_B26_1 object
EST_B27_1 object
EST_B25_FA2 object
EST_B26_2 object
EST_B27_2 object
EST_B25_FA3 object
EST_B26_3 object
EST_B27_3 object
EST_B28 object
EST_B29_FA1 object
EST_B30_1 object
EST_B31_1 object
EST_B29_FA2 object
EST_B30_2 object
EST_B31_2 object
EST_B29_FA3 object
EST_B30_3 object
EST_B31_3 object
EST2_SA object
EST2_NC int64
IDI_MT1 int64
IDI_MT2 object
IDIOMAS int64
IDIOMA1 object
NIV_ID1 object
ACREIDI1 object
TIPOACREIDI1 object
IDIOMA2 object
NIV_ID2 object
ACREIDI2 object
TIPOACREIDI2 object
IDIOMA3 object
NIV_ID3 object
ACREIDI3 object
TIPOACREIDI3 object
IDIOMA4 object
NIV_ID4 object
ACREIDI4 object
TIPOACREIDI4 object
TITIDI object
TIC int64
EST_B38_1 int64
EST_B39_1 object
EST_B38_2 int64
EST_B39_2 object
EST_B38_3 int64
EST_B39_3 object
EST_B38_4 int64
EST_B39_4 object
EST_B38_5 int64
EST_B39_5 object
EST_B38_6 int64
EST_B39_6 object
EST_B38_7 int64
EST_B39_7 object
MOV_IN object
MOVRAZ1 object
MOVRAZ2 object
MOVRAZ3 object
MOVRAZ4 object
MOVRAZ5 object
MVFUERA int64
MOVPAI1 object
MOVPAI2 object
MOVPAI3 object
MOVRA21 object
MOVRA22 object
MOVRA23 object
MOVRA24 object
MOVRA25 object
MOVRA26 object
MOV_C7 object
MOV_C8_1 object
MOV_C8_2 object
MOV_C8_3 object
MOV_C8_4 object
MOV_C8_5 object
MOV_C8_6 object
MOV_C9 object
RETORNO object
TRBPRN1 int64
TRBPRN2 object
TRINAC_D4 object
TRINAC_D5 object
TRINAC_D6 object
TRPARA_D5 object
TRPARA_D6 object
TRPARA_D7_1 object
TRPARA_D7_2 object
TRPARA_D7_3 object
TRPARA_D7_4 object
TRPARA_D7_5 object
TRPARA_D7_6 object
TRPARA_D7_7 object
TRPARA_D7_8 object
TRPARA_D7_9 object
TRPARA_D7_10 object
TRPARA_D8_1 object
TRPARA_D8_2 object
TRPARA_D8_3 object
TRPARA_D8_4 object
TRPARA_D8_5 object
TRPARA_D8_6 object
TRAC_D9 object
LUG_TRAB_PAIS object
SIT_PRO object
JORNADA object
TRABOC object
TR_CNAE object
TR_TAM object
TR_ANIO object
TR_SUELDO object
TR_D19 object
TR_D20 object
TR_D21 object
TR_D22_1 object
TR_D22_2 object
TR_D22_3 object
TR_D22_4 object
TR_D22_5 object
TR_D22_6 object
TR_D23 object
HL_E1 int64
HL_E2 object
HL_E3 int64
HL_E5 object
HL_JOR object
HL_E7 object
HL_E8 object
HA_TRAB int64
HATR_E11 object
HATR_E12 object
HATR_BSQ1 object
HATR_BSQ2 object
HATR_BSQ3 object
HATR_BSQ4 object
HATR_BSQ5 object
HATR_BSQ6 object
HATR_BSQ7 object
HATR_BSQ8 object
HATR_BSQ9 object
HATR_BSQ10 object
HATR_BSQ11 object
P_CONTI object
PR_PAIS object
PR_OCU object
PR_SIT_PR object
PR_JOR object
PR_NIVEL object
PR_AREA object
PR_CONOC object
PR_SUELDO object
HATR_TIEMP object
HATR_NUM object
HATR_E27 object
NOTRAB_BUS object
NOTRAB_BUSM object
NOTRAB_BUST object
NOTRAB_BSQ1 object
NOTRAB_BSQ2 object
NOTRAB_BSQ3 object
NOTRAB_BSQ4 object
NOTRAB_BSQ5 object
NOTRAB_BSQ6 object
NOTRAB_BSQ7 object
NOTRAB_BSQ8 object
NOTRAB_BSQ9 object
NOTRAB_BSQ10 object
NOTRAB_DIF1 object
NOTRAB_DIF2 object
NOTRAB_DIF3 object
NOTRAB_DIF4 object
NOTRAB_DIF5 object
NOTRAB_DIF6 object
RECHA_TR int64
RECHA_M1 object
RECHA_M2 object
RECHA_M3 object
RECHA_M4 object
RECHA_M5 object
RECHA_M6 object
RECHA_M7 object
RECHA_M8 object
RECHA_M9 object
HO_F1 int64
HO_PAREJ int64
HO_NPER int64
HO_NPER_TR int64
HO_TIPO int64
ALSSM15 int64
COTIZ15 object
DIAS15 float64
BCOTC15 object
ALSSM16 int64
COTIZ16 object
DIAS16 float64
BCOTC16 object
ALSSM17 int64
COTIZ17 object
DIAS17 float64
BCOTC17 object
ALSSM18 int64
COTIZ18 object
DIAS18 float64
BCOTC18 object
ALSSM19 int64
COTIZ19 object
DIAS19 float64
BCOTC19 object
N_CURS int64
DENCUR1 object
DURCUR1 object
RESCUR1 object
ANHCUR1 object
DENCUR2 object
DURCUR2 object
RESCUR2 object
ANHCUR2 object
DENCUR3 object
DURCUR3 object
RESCUR3 object
ANHCUR3 object
DENCUR4 object
DURCUR4 object
RESCUR4 object
ANHCUR4 object
DENCUR5 object
DURCUR5 object
RESCUR5 object
ANHCUR5 object
DENCUR6 object
DURCUR6 object
RESCUR6 object
ANHCUR6 object
FACTOR float64

#### 'IDENT'
**Índice** único del entrevistado.

In [5]:
df_grad['IDENT'].unique()

array([    1,     2,     3, ..., 31649, 31650, 31651])

#### 'SEXO'
**Sexo**: '1'=Hombre, '2'='Mujer'

In [6]:
df_grad['SEXO'].unique()

array([1, 2])

In [7]:
df_grad['SEXO'].value_counts()/df_grad['SEXO'].count()

2    0.570472
1    0.429528
Name: SEXO, dtype: float64

#### 'EDAD'
**Edad** del entrevistado: 1=Menores de 30 años, 2=De 30 a 34 años, 3=De 35 y más años.

In [8]:
df_grad['EDAD'].unique()

array([1, 2, 3])

In [9]:
df_grad['EDAD'].value_counts()/df_grad['EDAD'].count()

1    0.496256
2    0.278822
3    0.224922
Name: EDAD, dtype: float64

#### 'NACIO'
**Nacionalidad** del entrevistado: 1=Española, 2=Española y otra, 3=Otra nacionalidad

In [10]:
df_grad['NACIO'].unique()

array([1, 2, 3])

In [11]:
df_grad['NACIO'].value_counts()/df_grad['NACIO'].count()

1    0.978137
3    0.011027
2    0.010837
Name: NACIO, dtype: float64

#### 'NACIO1'
**País de primera nacionalidad**: 1=Un país de la UE, 2=Un país fuera de la UE, 9=NS/NC.

In [12]:
df_grad['NACIO1'].unique()

array([' ', '2', '9', '1'], dtype=object)

In [13]:
df_grad[['NACIO','NACIO1']].groupby('NACIO').agg(['unique'])

          NACIO1
          unique
NACIO
1            [ ]
2      [2, 1, 9]
3      [9, 2, 1]

In [14]:
# Se imputa nacionalidad de un país de la UE (1) a quien declaró nacionalidad española en variable 'NACIO'
df_grad['NACIO1'].mask(df_grad['NACIO']==1,'1',inplace=True)
df_grad['NACIO1']=df_grad['NACIO1'].astype('int')
df_grad[['NACIO','NACIO1']].groupby('NACIO').agg(['unique'])

          NACIO1
          unique
NACIO
1            [1]
2      [2, 1, 9]
3      [9, 2, 1]

#### 'NACIO2'
**País de segunda nacionalidad**: 1=Un país de la UE, 2=Un país fuera de la UE, 9=NS/NC.

In [15]:
df_grad['NACIO2'].unique()

array([' ', '1', '2'], dtype=object)

In [16]:
df_grad[['NACIO','NACIO2']].groupby('NACIO').agg(['unique'])

          NACIO2
          unique
NACIO
1            [ ]
2            [ ]
3      [ , 1, 2]

In [17]:
# Se imputa None a la no respuesta
df_grad['NACIO2'].replace({' ':None},inplace=True)
df_grad['NACIO2']=df_grad['NACIO2'].astype('float')
df_grad[['NACIO','NACIO2']].groupby('NACIO').agg(['unique'])

                NACIO2
                unique
NACIO
1                [nan]
2                [nan]
3      [nan, 1.0, 2.0]

#### 'PAIS_NACI'
**País de nacimiento**: 1=España, 2=Otro país de la UE, 3=Otro país fuera de la UE, 9=NS/NC

In [18]:
df_grad['PAIS_NACI'].unique()

array([1, 3, 2])

#### 'TITU'
**Titulación**:  
011101=Pedagogía, 011201=Educación infantil, 011301=Educación primaria, 011401=Otros maestros, 011901=Educación social,   
021101=Audiovisual, imagen y multimedia, 021201=Diseño, 021301=Bellas artes, 021302=Historia del arte, 021401=Conservación y restauración, 021502=Música y Artes escénicas, 022201=Arqueología, 022202=Historia, 022301=Filosofía, 022901=Humanidades, 023101=Lengua inglesa, 023102=Lenguas clásicas, 023103=Otras lenguas extranjeras, 023104=Traducción e interpretación, 023201=Lenguas y dialectos españoles, 023202=Literatura, 023901=Lenguas modernas y aplicadas,   
031101=Economía, 031201=Política y gestión pública, 031202=Relaciones internacionales, 031301=Psicología, 031401=Antropología social y cultural y Estudios y gestión de la cultura, 031402=Criminología, 031404=Geografía, 031406=Sociología e Igualdad de género, 032101=Comunicación, 032102=Periodismo, 032201=Información y documentación,   
041201=Financiera y actuarial, 041202=Finanzas y contabilidad, 041301=Administración y empresa, 041302=Ciencias del trabajo, 041303=Gestión y administración pública, 041401=Marketing, 041402=Protocolo y eventos, 041403=Publicidad y relaciones públicas, 041601=Comercio, 042101=Derecho,   
051101=Biología, 051201=Bioquímica, 051202=Biotecnología, 051901=Biomedicina, 052101=Ciencias ambientales, 053101=Química, 053201=Ciencias del mar, 053202=Geografía y ordenación del territorio, 053203=Geología, 053301=Física, 054101=Matemáticas, 054201=Estadística,   
061301=Desarrollo de software y de aplicaciones e Ingeniería multimedia, 061901=Informática,   
071101=Ingeniería química industrial e Ingeniería medioambiental, 071301=Ingeniería de la energía, 071302=Ingeniería eléctrica, 071401=Ingeniería de computadores, 071402=Ingeniería de sonido e imagen, 071403=Ingeniería de telecomunicación, 071404=Ingeniería electrónica industrial y automática, 071405=Ingeniería en electrónica, 071501=Ingeniería en diseño industrial y desarrollo del producto, 071502=Ingeniería en tecnologías industriales, 071503=Ingeniería mecánica, 071601=Ingeniería aeronáutica, 071603=Ingeniería naval y oceánica, 071901=Ingeniería de organización industrial y Nanotecnología, 072101=Ciencia y tecnología de los alimentos e Ingeniería alimentaria, 072102=Enología, 072201=Ingeniería de materiales e Ingeniería textil, 072401	=Ingeniería de minas y energía, 073101=Arquitectura y Urbanismo y paisajismo, 073102=Ingeniería geomática, topografía y cartografía, 073201=Arquitectura técnica, 073202=Ingeniería civil,   
081102=Ingeniería agraria y agroalimentaria, 081103=Ingeniería agrícola, agropecuaria y medio rural, 081201=Ingeniería horticultura y jardinería, 082101=Ingeniería forestal y montes, 084101=Veterinaria,   
091101=Odontología, 091201=Medicina, 091301=Enfermería, 091401=Ingeniería biomédica y de la salud, 091402=Óptica y optometría, 091501=Fisioterapia, 091502=Logopedia, 091503=Nutrición humana y dietética, 091504=Podología, 091505=Terapia ocupacional, 091601=Farmacia, 092301=Trabajo social,   
101401=Actividad física y del deporte, 101501=Turismo, 104101=Náutica y transporte marítimo, 104103=Servicio de transporte terrestre y Servicio de transporte aéreo, 109999=Servicios (otros estudios).

In [19]:
df_grad['TITU'].unique()

array([ 11101,  11201,  11301,  11401,  11901,  21101,  21201,  21301,
        21302,  21401,  21502,  22201,  22202,  22301,  22901,  23101,
        23102,  23103,  23104,  23201,  23202,  23901,  31101,  31201,
        31202,  31301,  31401,  31402,  31404,  31406,  32101,  32102,
        32201,  41201,  41202,  41301,  41302,  41303,  41401,  41402,
        41403,  41601,  42101,  51101,  51201,  51202,  51901,  52101,
        53101,  53201,  53202,  53203,  53301,  54101,  54201,  61301,
        61901,  71101,  71301,  71302,  71401,  71402,  71403,  71404,
        71405,  71501,  71502,  71503,  71601,  71603,  71901,  72101,
        72102,  72201,  72401,  73101,  73102,  73201,  73202,  81102,
        81103,  81201,  82101,  84101,  91101,  91201,  91301,  91401,
        91402,  91501,  91502,  91503,  91504,  91505,  91601,  92301,
       101401, 101501, 104101, 104103, 109999])

#### 'RAMA'
**Rama de conocimiento** de la titulación:  
1=Artes y humanidades, 2=Ciencias, 3=Ciencias sociales y jurídicas, 4=Ingeniería y arquitectura, 5=Ciencias de la salud

In [20]:
df_grad['RAMA'].unique()

array([3, 1, 4, 5, 2])

In [21]:
df_grad['RAMA'].value_counts()/df_grad['RAMA'].count()

3    0.458248
4    0.211842
5    0.141796
1    0.100376
2    0.087738
Name: RAMA, dtype: float64

In [22]:
# Varias titulaciones adscritas a más de una rama del conocimiento
df_grad[['RAMA','TITU']].groupby('TITU').agg(['unique'])

          RAMA
        unique
TITU
11101   [3, 1]
11201      [3]
11301      [3]
11401      [3]
11901      [3]
...        ...
101401  [3, 5]
101501     [3]
104101     [4]
104103  [3, 4]
109999  [3, 4]

[101 rows x 1 columns]

In [23]:
df_grad[['RAMA','TITU']].groupby('RAMA').agg(['unique'])

                                                                                                                                                                                                                                                                  TITU
                                                                                                                                                                                                                                                                unique
RAMA
1                                                                                      [11101, 21101, 21201, 21301, 21302, 21401, 21502, 22201, 22202, 22301, 22901, 23101, 23102, 23103, 23104, 23201, 23202, 23901, 31401, 31404, 32101, 32102, 32201, 53202, 73101]
2                                                                                                                                                     [51101, 51201, 51202, 51901, 52101, 53101, 53201, 53203, 53301, 54101, 54201, 71901, 72101, 72102, 91402, 91503]
3     [11101, 11201, 11301, 11401, 11901, 21101, 23104, 31101, 31201, 31202, 31301, 31401, 31402, 31404, 31406, 32101, 32102, 32201, 41201, 41202, 41301, 41302, 41303, 41401, 41402, 41403, 41601, 42101, 53202, 54201, 91501, 92301, 101401, 101501, 104103, 109999]
4             [21101, 21201, 53203, 54101, 61301, 61901, 71101, 71301, 71302, 71401, 71402, 71403, 71404, 71405, 71501, 71502, 71503, 71601, 71603, 71901, 72101, 72201, 72401, 73101, 73102, 73201, 73202, 81102, 81103, 81201, 82101, 91401, 104101, 104103, 109999]
5                                                                                                                                                    [31301, 51101, 51901, 72101, 84101, 91101, 91201, 91301, 91402, 91501, 91502, 91503, 91504, 91505, 91601, 101401]

#### 'AMBITO'
**Ámbito de estudio**: 0112=Formación de docentes de enseñanza infantil, 0113=Formación de docentes de enseñanza primaria, 011=Educación (Otros estudios), 0211=Técnicas audiovisuales y medios de comunicación, 021=Artes (Otros estudios), 022=Humanidades, 023=Lenguas, 0311=Economía, 0313=Psicología, 031=Ciencias sociales y del comportamiento (Otros estudios), 032=Periodismo y documentación, 0413=Dirección y administración, 041=Negocios y administración (Otros estudios), 042=Derecho, 051=Ciencias de la vida, 052=Medio ambiente, 053=Ciencias químicas, físicas y geológicas, 054=Matemáticas y estadística, 061=Informática, 071=Ingeniería y profesiones afines, 072=Industria manufacturera y producción, 073=Arquitectura y construcción, 081=Agricultura y ganadería, 082=Silvicultura, 084=Veterinaria, 0912=Medicina, 0913=Enfermería, 091=Salud (Otros estudios), 092=Servicios sociales, 1014=Actividades físicas y deportivas, 1015=Viajes, turismo y ocio, 109=Servicios (Otros estudios), 9999=NS/NC.

In [24]:
df_grad['AMBITO'].unique()

array([  11,  112,  113,  211,   21,   22,   23,  311,   31,  313,   32,
         41,  413,   42,   51,   52,   53,   54,   61,   71,   72,   73,
         81,   82,   84,   91,  912,  913,   92, 1014, 1015,  109])

In [25]:
# Todas las titulaciones adscritas a un único ámbito de estudio 
for row in range(0,len(df_grad[['TITU','AMBITO']].groupby('TITU'))):
    print (df_grad[['TITU','AMBITO']].groupby('TITU').agg(['unique']).iloc[row])

AMBITO  unique    [11]
Name: 11101, dtype: object
AMBITO  unique    [112]
Name: 11201, dtype: object
AMBITO  unique    [113]
Name: 11301, dtype: object
AMBITO  unique    [11]
Name: 11401, dtype: object
AMBITO  unique    [11]
Name: 11901, dtype: object
AMBITO  unique    [211]
Name: 21101, dtype: object
AMBITO  unique    [21]
Name: 21201, dtype: object
AMBITO  unique    [21]
Name: 21301, dtype: object
AMBITO  unique    [21]
Name: 21302, dtype: object
AMBITO  unique    [21]
Name: 21401, dtype: object
AMBITO  unique    [21]
Name: 21502, dtype: object
AMBITO  unique    [22]
Name: 22201, dtype: object
AMBITO  unique    [22]
Name: 22202, dtype: object
AMBITO  unique    [22]
Name: 22301, dtype: object
AMBITO  unique    [22]
Name: 22901, dtype: object
AMBITO  unique    [23]
Name: 23101, dtype: object
AMBITO  unique    [23]
Name: 23102, dtype: object
AMBITO  unique    [23]
Name: 23103, dtype: object
AMBITO  unique    [23]
Name: 23104, dtype: object
AMBITO  unique    [23]
Name: 23201, dtype: object
AMBITO  unique    [23]
Name: 23202, dtype: object
AMBITO  unique    [23]
Name: 23901, dtype: object
AMBITO  unique    [311]
Name: 31101, dtype: object
AMBITO  unique    [31]
Name: 31201, dtype: object
AMBITO  unique    [31]
Name: 31202, dtype: object
AMBITO  unique    [313]
Name: 31301, dtype: object
AMBITO  unique    [31]
Name: 31401, dtype: object
AMBITO  unique    [31]
Name: 31402, dtype: object
AMBITO  unique    [31]
Name: 31404, dtype: object
AMBITO  unique    [31]
Name: 31406, dtype: object
AMBITO  unique    [32]
Name: 32101, dtype: object
AMBITO  unique    [32]
Name: 32102, dtype: object
AMBITO  unique    [32]
Name: 32201, dtype: object
AMBITO  unique    [41]
Name: 41201, dtype: object
AMBITO  unique    [41]
Name: 41202, dtype: object
AMBITO  unique    [413]
Name: 41301, dtype: object
AMBITO  unique    [413]
Name: 41302, dtype: object
AMBITO  unique    [413]
Name: 41303, dtype: object
AMBITO  unique    [41]
Name: 41401, dtype: object
AMBITO  unique    [41]
Name: 41402, dtype: object
AMBITO  unique    [41]
Name: 41403, dtype: object
AMBITO  unique    [41]
Name: 41601, dtype: object
AMBITO  unique    [42]
Name: 42101, dtype: object
AMBITO  unique    [51]
Name: 51101, dtype: object
AMBITO  unique    [51]
Name: 51201, dtype: object
AMBITO  unique    [51]
Name: 51202, dtype: object
AMBITO  unique    [51]
Name: 51901, dtype: object
AMBITO  unique    [52]
Name: 52101, dtype: object
AMBITO  unique    [53]
Name: 53101, dtype: object
AMBITO  unique    [53]
Name: 53201, dtype: object
AMBITO  unique    [53]
Name: 53202, dtype: object
AMBITO  unique    [53]
Name: 53203, dtype: object
AMBITO  unique    [53]
Name: 53301, dtype: object
AMBITO  unique    [54]
Name: 54101, dtype: object
AMBITO  unique    [54]
Name: 54201, dtype: object
AMBITO  unique    [61]
Name: 61301, dtype: object
AMBITO  unique    [61]
Name: 61901, dtype: object
AMBITO  unique    [71]
Name: 71101, dtype: object
AMBITO  unique    [71]
Name: 71301, dtype: object
AMBITO  unique    [71]
Name: 71302, dtype: object
AMBITO  unique    [71]
Name: 71401, dtype: object
AMBITO  unique    [71]
Name: 71402, dtype: object
AMBITO  unique    [71]
Name: 71403, dtype: object
AMBITO  unique    [71]
Name: 71404, dtype: object
AMBITO  unique    [71]
Name: 71405, dtype: object
AMBITO  unique    [71]
Name: 71501, dtype: object
AMBITO  unique    [71]
Name: 71502, dtype: object
AMBITO  unique    [71]
Name: 71503, dtype: object
AMBITO  unique    [71]
Name: 71601, dtype: object
AMBITO  unique    [71]
Name: 71603, dtype: object
AMBITO  unique    [71]
Name: 71901, dtype: object
AMBITO  unique    [72]
Name: 72101, dtype: object
AMBITO  unique    [72]
Name: 72102, dtype: object
AMBITO  unique    [72]
Name: 72201, dtype: object
AMBITO  unique    [72]
Name: 72401, dtype: object
AMBITO  unique    [73]
Name: 73101, dtype: object
AMBITO  unique    [73]
Name: 73102, dtype: object
AMBITO  unique    [73]
Name: 73201, dtype: object
AMBITO  unique    [73]
Name: 73202, dtype: object
AMBITO  unique    [81]
Name: 81102, dtype: object
AMBITO  unique    [81]
Name: 81103, dtype: object
AMBITO  unique    [81]
Name: 81201, dtype: object
AMBITO  unique    [82]
Name: 82101, dtype: object
AMBITO  unique    [84]
Name: 84101, dtype: object
AMBITO  unique    [91]
Name: 91101, dtype: object
AMBITO  unique    [912]
Name: 91201, dtype: object
AMBITO  unique    [913]
Name: 91301, dtype: object
AMBITO  unique    [91]
Name: 91401, dtype: object
AMBITO  unique    [91]
Name: 91402, dtype: object
AMBITO  unique    [91]
Name: 91501, dtype: object
AMBITO  unique    [91]
Name: 91502, dtype: object
AMBITO  unique    [91]
Name: 91503, dtype: object
AMBITO  unique    [91]
Name: 91504, dtype: object
AMBITO  unique    [91]
Name: 91505, dtype: object
AMBITO  unique    [91]
Name: 91601, dtype: object
AMBITO  unique    [92]
Name: 92301, dtype: object
AMBITO  unique    [1014]
Name: 101401, dtype: object
AMBITO  unique    [1015]
Name: 101501, dtype: object
AMBITO  unique    [109]
Name: 104101, dtype: object
AMBITO  unique    [109]
Name: 104103, dtype: object
AMBITO  unique    [109]
Name: 109999, dtype: object

In [26]:
# Varias ramas adscritas a más de un ámbito de estudio
df_grad[['RAMA','AMBITO']].groupby('AMBITO').agg(['unique'])

                RAMA
              unique
AMBITO
11            [3, 1]
21            [1, 4]
22               [1]
23            [1, 3]
31            [3, 1]
32            [3, 1]
41               [3]
42               [3]
51            [2, 5]
52               [2]
53      [2, 1, 3, 4]
54         [2, 4, 3]
61               [4]
71            [4, 2]
72         [4, 5, 2]
73            [4, 1]
81               [4]
82               [4]
84               [5]
91      [5, 4, 2, 3]
92               [3]
109           [4, 3]
112              [3]
113              [3]
211        [3, 1, 4]
311              [3]
313           [5, 3]
413              [3]
912              [5]
913              [5]
1014          [3, 5]
1015             [3]

#### 'T_UNIV'
**Tipo de universidad**: 1=Universidad Pública presencial, 2=Universidad Pública a distancia, 3=Universidad Privada presencial, 4=Universidad Privada a distancia.

In [27]:
df_grad['T_UNIV'].unique()

array([2, 1, 4, 3])

In [28]:
df_grad['T_UNIV'].value_counts()

1    25898
3     3793
2     1080
4      880
Name: T_UNIV, dtype: int64

In [29]:
df_grad['T_UNIV'].value_counts()/df_grad['T_UNIV'].count()

1    0.818236
3    0.119838
2    0.034122
4    0.027803
Name: T_UNIV, dtype: float64

#### 'DISCA'
Tiene **discapacidad reconocida** superior al 33 %: 1=Sí, 2=No.

In [30]:
df_grad['DISCA'].unique()

array([2, 1])

In [31]:
df_grad['DISCA'].value_counts()/df_grad['DISCA'].count()

2    0.987804
1    0.012196
Name: DISCA, dtype: float64

In [32]:
df_grad[['T_UNIV','DISCA']].groupby(['T_UNIV','DISCA']).agg({'DISCA':'count'})

              DISCA
T_UNIV DISCA
1      1        315
       2      25583
2      1         29
       2       1051
3      1         23
       2       3770
4      1         19
       2        861

In [33]:
df_grad[['T_UNIV','DISCA']].groupby('T_UNIV').agg({'DISCA':'count'})

        DISCA
T_UNIV
1       25898
2        1080
3        3793
4         880

In [34]:
# Proporción de discapacidad en cada tipo de universidad: 
df_grad[['T_UNIV','DISCA']].groupby(['T_UNIV','DISCA']).agg({'DISCA':'count'}
                ).div(df_grad[['T_UNIV','DISCA']].groupby('T_UNIV').agg({'DISCA':'count'}),level='T_UNIV')

                 DISCA
T_UNIV DISCA
1      1      0.012163
       2      0.987837
2      1      0.026852
       2      0.973148
3      1      0.006064
       2      0.993936
4      1      0.021591
       2      0.978409

In [35]:
# Proporción de universidad de cada tipo según discapacidad: 
df_grad[['DISCA','T_UNIV']].groupby(['DISCA','T_UNIV']).agg({'T_UNIV':'count'}
                ).div(df_grad[['DISCA','T_UNIV']].groupby('DISCA').agg({'T_UNIV':'count'}),level='DISCA')

                T_UNIV
DISCA T_UNIV
1     1       0.816062
      2       0.075130
      3       0.059585
      4       0.049223
2     1       0.818263
      2       0.033616
      3       0.120582
      4       0.027539